In [1]:
import pandas as pd
import mysql.connector
from sqlalchemy import create_engine

In [3]:
df = pd.read_csv('/home/mubeen/Downloads/movies.csv')

In [4]:
df.sample(3)

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,runtime
1481,My Left Foot,R,Biography,1989,"March 30, 1990 (United States)",7.9,70000,Jim Sheridan,Shane Connaughton,Daniel Day-Lewis,Ireland,0,14743391.0,Ferndale Films,103
2277,In the Line of Fire,R,Action,1993,"July 9, 1993 (United States)",7.2,96000,Wolfgang Petersen,Jeff Maguire,Clint Eastwood,United States,40000000,176997168.0,Columbia Pictures,128
3584,Dudley Do-Right,PG,Comedy,1999,"August 27, 1999 (United States)",3.9,10000,Hugh Wilson,Jay Ward,Brendan Fraser,United States,70000000,9974410.0,Universal Pictures,77

In [5]:
mysql_config = {
    'host': 'localhost',
    'port': '3307',  
    'user': 'root',
    'password': '',
    'database': 'mydb'
}

In [6]:
def dataframe_to_mysql(df, table_name, mysql_config):
    conn = mysql.connector.connect(**mysql_config)
    engine = create_engine(f"mysql+mysqlconnector://{mysql_config['user']}:{mysql_config['password']}@{mysql_config['host']}:{mysql_config['port']}/{mysql_config['database']}")
    df.to_sql(name=table_name, con=engine, index=False, if_exists='replace')
    # query = f'SELECT * FROM {table_name};'
    # result_df = pd.read_sql(query, con=engine)

In [7]:
dataframe_to_mysql(df, 'movies', mysql_config)